<?php

namespace app\api\block;


/**
 *
 */
class AgreementBlock
{

    public static function content()
    {

        $data = "欢迎您注册/登录使用《金石游戏中心》的推广员系统（下称“本系统”）。请您在注册/登录本系统前仔细阅读《金石游戏中心推广员合作协议》（下称“本协议”）的所有内容，特别是有关推广员的义务的条款，以及免除、限制我方责任的条款。本协议是金石游戏中心（下称我方）与金石游戏中心推广员（下称“推广员”或“你方”）所约定的规范双方权利、义务关系的电子合同。<br/>
如您对本协议任何内容有异议，请不要注册及登录/使用本系统。当您点击确认键注册或者登录或使用本系统相关服务，则视为您已仔细阅读本协议所有内容，同意接受本协议的所有规定及我方相关政策的约束，成为推广员，有权从我方批量购买《金石游戏中心》（下称本游戏）的房卡等产品或服务，并对外转售。<br/>
一、合作内容 <br/>
1.协助我方提升本游戏的房卡销售数量，提升本游戏的玩家用户规模。 <br/>
2.为实现前述目的，你方可通过线下场所或线上渠道（QQ群、QQ、贴吧、论坛、空间、微信、微博等）、自身人际关系、非官方网络资源等各种合法方式和渠道，推广本游戏，我方将提供必要的支持和协助。 <br/>
3.为实现前述目的，双方共同将为本游戏做正面宣传，扩大本游戏的知名度和美誉度。<br/>
二、推广员的权利和义务 <br/>
1.推广员有权参与我方组织的市场推广活动，并从我方获得相应的奖励；<br/>
2.推广员不享有本游戏在任何区域的独家合作资格。<br/>
3.在合作推广过程中，推广员的任何行为均不得包含有虚假、诱骗、违反国家法律法规的内容，也不得做出有悖于金石游戏中心对外公布的相关公告、协议内容的承诺或行为，不得通过组织、参与违法活动来追求推广业绩。若我方发现推广员存在该行为，将对其采取冻结或封停代理账户的处理，你方独自承担一切法律后果，且我方有权向国家有关机关做举报。<br/>
4.推广员有义务积极维护和宣传我方的品牌、业务和政策，不煽动、不参与任何形式的不利于我方品牌、业务、政策的活动。你方不可假冒和改变我方的商标、标志、商业信息等，不得故意造成与我方产品或服务的混淆，不得以我方公司或员工名义对外从事任何活动。
5.推广员须保证在进行本游戏推广之前已经获得线上或者线下场所的许可，并遵守相应的线上线下法律规章制度，否则由此产生的纠纷和可能导致的一切责任由推广员本人承担；推广员同意我方对此免责。 
6.推广员在注册和使用本系统过程中所提供的个人资料及相关信息是我方判断你方身份的重要依据，你方应根据要求尽可能提供详尽的信息，并确保信息的完整性、合法性和真实性。如推广员提交的资料有任何变动，必须在本系统中及时更新,必要时以电话或邮件形式告知我方管理人员，以保证其资料准确性。如果推广员不能提供准确完整的个人信息、未及时更新相关信息或者提供相关的资料，将导致我方无法准确判断推广员的身份，从而影响到推广收益发放等操作。因此给推广员造成的损失，我方不承担任何责任。
7.如因推广员提交的信息资料不真实、不准确、不完整、不合法从而导致我方作出错误判断、遭受直接或间接经济损失的，我方有权立即取消该推广员的资格并追究推广员的法律责任。<br/>
8.推广员仅能依据本协议约定的内容，从事金石游戏中心的推广活动，不得将本协议约定的权利、义务转让给任何第三方，不得擅自委托第三方从事本游戏的推广行为。<br/>
9.推广员拥有自主的权利，可单方面随时决定终止与我方的合作、并停止使用本系统相关服务。如我方对本协议内容或相关服务等作出任何变更，而推广员不同意有关变更内容的，推广员应立即终止与我方的合作、并停止使用本系统相关服务。<br/>
三、金石游戏中心的权利和义务 <br/>
1.金石游戏中心会对推广员提交的注册信息和资料进行及时审核，并有权根据公司业务发展需要，做出通过或不通过的决定。 <br/>
2.金石游戏中心有权了解推广员的推广情况，获得与推广员信息和推广业绩相关的必要的资料、数据和有关证据。<br/>
3.金石游戏中心会根据推广员的推广业绩和公司政策，将推广员应得的收益及时支付到位。<br/>
4.金石游戏中心将通过本系统的消息通知、电子邮件等方式，将最新的公司政策（包括但不限于优惠政策、对推广员的推广业绩要求等）下发给推广员。推广员有义务遵守、配合公司的各项政策。<br/>
5.金石游戏中心有权根据实际需要随时修改本协议，并通过公告、系统消息或邮件等形式公布，修改自公告公布之日、或消息送达推广员邮箱之日起生效。推广员如有异议，可立即停止本协议，并与我方协商结算事宜。<br/>
6.金石游戏中心有权单方随时变更、中断或终止本系统及相关服务，且不需对玩家或任何第三方负责。除本协议另有约定外，金石游戏中心将以电话、短信、系统消息/页面或者电子邮件方式通知推广员。终止合作通知自发出之时即视为送达。如因推广员资料中登记的联络方式不正确、不完整或者不真实而导致联络失败的，金石游戏中心无需对因此导致的任何损失或损害承担法律责任。 <br/>
7.金石游戏中心有权根据公司业务发展需要，终止本协议涉及的合作。在此情况下，金石游戏中心应通过发布公告等形式通知推广员，协议的终止自公告发布之日起生效。<br/>
8.金石游戏中心将竭力保证本游戏相关系统和数据的稳定，但因技术问题或第三方原因导致产品宕机、数据丢失等问题，我方不向你方或其他第三方承担赔偿、补偿的法律义务。 <br/>
9.金石游戏中心有权要求推广员配合我方的相关推广工作，以保证推广本游戏的效果和效率。 <br/>
10.尊重个人隐私是金石游戏中心的重要政策。在未经授权的情况下，金石游戏中心不会公开或向第三方透露推广员在申请时提交的个人资料。但如根据法律规定或政府有权部门的有效命令，或在以下三种情况下，金石游戏中心可不经授权而向相关部门或第三方公开或透露推广员的个人信息： <br/>
a.在紧急情况下维护推广员个人、第三人或社会大众的财产或人身安全；<br/> 
b.保持、维护金石游戏中心的知识产权或其它合法权益； <br/>
c.根据金石游戏中心游戏服务的相关规则、制度、条款，应当公开或披露的。<br/>
四、推广收益<br/>
推广员按照金石游戏中心相关规定申领推广收益。具体兑换规则以公司的通知为准。金石游戏中心将在后台确认推广业绩并在业绩确认后十个工作日内将推广收益发放至推广员账户。<br/>
五、声明 <br/>
金石游戏中心与推广员在此声明：双方不会因根据本协议产生的推广合作，构成任何形式的劳动合同关系或劳务关系。推广员不隶属于金石游戏中心，不受金石游戏中心内部规章制度的约束。金石游戏中心除向推广员支付本协议约定的推广收益外，不承担推广员的任何其他费用，包括但不限于因推广员因推广活动所产生的成本、社会保险、福利和医疗保险费用等。 金石游戏中心与推广员共同在此声明：本协议不包含任何可能理解为双方之间设立一种代理关系的内容。推广员无权代表金石游戏中心对外缔结合同。推广员不得以金石游戏中心的名义开展任何与本协议约定推广活动无关的活动，或者从事违法犯罪活动，否则一切后果由推广员自行承担，金石游戏中心并保留追究其法律责任的权利。<br/>
六、违约责任 <br/>
如推广员有违反本协议第二条第4、5、6、7、8款之规定的行为，金石游戏中心有权根据推广员的违约事实和严重程度，对其采取扣发推广收益、停止发放推广收益、暂停推广合作资格、停止推广合作资格等措施，并有权向推广员追讨其通过不当行为所获得的利益。 推广员对此充分理解并认可。<br/>
七、不可抗力<br/>
1.一方因不可抗力不能履行本协议的，根据不可抗力的影响，可以部分或者全部免除违约责任。但一方迟延履行后发生不可抗力的，不能免除责任。<br/>
2.一方因不可抗力不能履行本协议的，应当及时通知对方，以减轻可能给对方造成的损失，并在合理期限内提供证明。未及时通知的，对因迟延通知而造成的扩大损失依然承担赔偿责任。<br/>
3.一方因不可抗力不能履行合同，但尚未造成对本协议根本违约的，另一方应该在履约时间上给予对方适当的宽限；如果因不可抗力导致不能实现本协议目的的，双方均有权解除本协议。<br/>
八、协议的生效和终止 <br/>
1.协议的生效：本协议自您登录推广系统并点击“同意《协议》”时生效。 <br/>
2.下列情形之一出现时，本协议终止： <br/>
a.本协议约定的合作期限届满；<br/> 
b.本游戏终止运营；<br/> 
c.在本协议有效期内，推广员被依法追究刑事责任的，金石游戏中心有权单方面终止本协议；<br/> 
d.其他按照法律规定以及本协议约定的终止情况<br/>
八、其他约定 <br/>
本协议未尽事宜，可由双方另行签订补充协议予以明确。补充协议的内容与本协议的内容有冲突的，优先适用补充协议的规定。 推广员与金石游戏中心在合作中产生的争议，应当友好协商解决；协商不成的，任何一方均有权向被告所在地有管辖权的法院提起诉讼。
河源市盛皓网络科技有限公司<br/>

《金石游戏中心》合法合规声明<br/>
前言<br/>
欢迎您使用盛皓公司开发的金石游戏中心棋牌游戏！ 盛皓公司将遵循国家对网络游戏的相关规定，提倡公平、公正的游戏氛围，竭力为所有用户打造一个绿色健康的棋牌游戏环境，为用户提供更优质的服务。<br/>
一、棋牌游戏相关政策<br/>
1.根据文化部和公安部等相关规定，盛皓公司有权拒绝为用户提供积分交易、兑换或以“虚拟货币”等方式变相兑换现金、财物的服务和用户间赠与、转让等游戏积分转账服务，并且盛皓公司有权限制用户在使用金石游戏中心服务时每局、每日游戏币、游戏积分或者其他游戏道具输赢数量以及采取其他法律法规要求采取的措施，具体内容将由盛皓单独制定并在各棋牌游戏界面中以合适的方式向用户提示<br/>
2.盛皓公司对于用户在金石游戏中心中获得的虚拟货币、游戏积分及其他游戏内虚拟物品等均不提供任何形式的官方回购、官方直接或变相兑换现金、用户间相互赠送、转让等服务及相关功能。<br/>
二、禁止赌博等违法违规行为<br/>
金石游戏中心提倡绿色健康游戏，坚决打击以任何形式利用金石游戏中心宣扬、实施赌博或其他违法违规的行为，包括但不限于：<br/>
1.在游戏内或其他线上、线下渠道宣扬赌博或直接/变相收购、倒卖虚拟货币、游戏积分、游戏币或其他游戏道具等；<br/>
2.利用金石游戏中心进行赌博、开设赌局、坐庄涉赌“抽水”等赌博活动；<br/>
3.通过包括但不限于在游戏对局中放炮、做牌、逃跑等方式故意导致游戏币等输给其他用户、不合理拖延比赛时间而影响游戏公平的行为； <br/>
4.合伙杀猪、暗示或其他通牌行为； <br/>
5.刷屏、挂机、放水等消极行为；<br/> 
6.试图用第三方软件扰乱游戏环境，影响游戏数据的行为；<br/>
7.一人登录多台设备，进入同一房间与其他用户进行游戏；<br/>
8.其他违反《金石游戏中心玩家协议》或违法违规的行为；<br/>
用户有以上任一行为的，盛皓公司将予以严厉打击和处罚，包括但不限于采取如下一项或几项处罚措施：警告、禁言、倒扣数值、暂时冻结玩法、永久冻结玩法、冻结或回收游戏虚拟物品、暂时禁止登陆、永久禁止登陆、强制离线、封停账号、删除档案及其他技术措施，以防止用户从事此类行为；公司对此类行为不承担任何责任，并保有提交用户不正当行为证据给相应国家管理部门，并配合进行处理的权力。<br/>
欢迎各位用户积极参与进来，一起努力，共同打造一个公平、健康的游戏环境！<br/> ";


       return $data;
    }


    public static function contentlucky(){

        $content = "欢迎您注册/登录使用《幸运王国》的推广员系统（下称“本系统”）。请您在注册/登录本系统前仔细阅读《幸运王国推广员合作协议》（下称“本协议”）的所有内容，特别是有关推广员的义务的条款，以及免除、限制我方责任的条款。本协议是幸运王国（下称我方）与幸运王国推广员（下称“推广员”或“你方”）所约定的规范双方权利、义务关系的电子合同。</br>
如您对本协议任何内容有异议，请不要注册及登录/</br>使用本系统。当您点击确认键注册或者登录或使用本系统相关服务，则视为您已仔细阅读本协议所有内容，同意接受本协议的所有规定及我方相关政策的约束，成为推广员。</br>
一、合作内容 </br>
1.协助我方提升本游戏的金币消耗数量，提升本游戏的玩家用户规模。</br> 
2.为实现前述目的，你方可通过线下场所或线上渠道（QQ群、QQ、贴吧、论坛、空间、微信、微博等）、自身人际关系、非官方网络资源等各种合法方式和渠道，推广本游戏，我方将提供必要的支持和协助。</br> 
3.为实现前述目的，双方共同将为本游戏做正面宣传，扩大本游戏的知名度和美誉度。</br>
二、推广员的权利和义务 </br>
1.推广员有权参与我方组织的市场推广活动，并从我方获得相应的奖励；</br>
2.推广员不享有本游戏在任何区域的独家合作资格。</br>
3.在合作推广过程中，推广员的任何行为均不得包含有虚假、诱骗、违反国家法律法规的内容，也不得做出有悖于幸运王国对外公布的相关公告、协议内容的承诺或行为，不得通过组织、参与违法活动来追求推广业绩。若我方发现推广员存在该行为，将对其采取冻结或封停代理账户的处理，你方独自承担一切法律后果，且我方有权向国家有关机关做举报。</br>
4.推广员有义务积极维护和宣传我方的品牌、业务和政策，不煽动、不参与任何形式的不利于我方品牌、业务、政策的活动。你方不可假冒和改变我方的商标、标志、商业信息等，不得故意造成与我方产品或服务的混淆，不得以我方公司或员工名义对外从事任何活动。</br>
5.推广员须保证在进行本游戏推广之前已经获得线上或者线下场所的许可，并遵守相应的线上线下法律规章制度，否则由此产生的纠纷和可能导致的一切责任由推广员本人承担；推广员同意我方对此免责。</br> 
6.推广员在注册和使用本系统过程中所提供的个人资料及相关信息是我方判断你方身份的重要依据，你方应根据要求尽可能提供详尽的信息，并确保信息的完整性、合法性和真实性。如推广员提交的资料有任何变动，必须在本系统中及时更新,必要时以电话或邮件形式告知我方管理人员，以保证其资料准确性。如果推广员不能提供准确完整的个人信息、未及时更新相关信息或者提供相关的资料，将导致我方无法准确判断推广员的身份，从而影响到推广收益发放等操作。因此给推广员造成的损失，我方不承担任何责任。</br>
7.如因推广员提交的信息资料不真实、不准确、不完整、不合法从而导致我方作出错误判断、遭受直接或间接经济损失的，我方有权立即取消该推广员的资格并追究推广员的法律责任。</br>
8.推广员仅能依据本协议约定的内容，从事幸运王国的推广活动，不得将本协议约定的权利、义务转让给任何第三方，不得擅自委托第三方从事本游戏的推广行为。</br>
9.推广员拥有自主的权利，可单方面随时决定终止与我方的合作、并停止使用本系统相关服务。如我方对本协议内容或相关服务等作出任何变更，而推广员不同意有关变更内容的，推广员应立即终止与我方的合作、并停止使用本系统相关服务。</br>
三、幸运王国的权利和义务 </br>
1.幸运王国会对推广员提交的注册信息和资料进行及时审核，并有权根据公司业务发展需要，做出通过或不通过的决定。</br> 
2.幸运王国有权了解推广员的推广情况，获得与推广员信息和推广业绩相关的必要的资料、数据和有关证据。</br>
3.幸运王国会根据推广员的推广业绩和公司政策，将推广员应得的收益及时支付到位。</br>
4.幸运王国将通过本系统的消息通知、电子邮件等方式，将最新的公司政策（包括但不限于优惠政策、对推广员的推广业绩要求等）下发给推广员。推广员有义务遵守、配合公司的各项政策</br>。
5.幸运王国有权根据实际需要随时修改本协议，并通过公告、系统消息或邮件等形式公布，修改自公告公布之日、或消息送达推广员邮箱之日起生效。推广员如有异议，可立即停止本协议，并与我方协商结算事宜。</br>
6.幸运王国有权单方随时变更、中断或终止本系统及相关服务，且不需对玩家或任何第三方负责。除本协议另有约定外，幸运王国将以电话、短信、系统消息/页面或者电子邮件方式通知推广员。终止合作通知自发出之时即视为送达。如因推广员资料中登记的联络方式不正确、不完整或者不真实而导致联络失败的，幸运王国无需对因此导致的任何损失或损害承担法律责任。</br> 
7.幸运王国有权根据公司业务发展需要，终止本协议涉及的合作。在此情况下，幸运王国应通过发布公告等形式通知推广员，协议的终止自公告发布之日起生效。</br>
8.幸运王国将竭力保证本游戏相关系统和数据的稳定，但因技术问题或第三方原因导致产品宕机、数据丢失等问题，我方不向你方或其他第三方承担赔偿、补偿的法律义务。</br>
9.幸运王国有权要求推广员配合我方的相关推广工作，以保证推广本游戏的效果和效率。</br> 
10.尊重个人隐私是幸运王国的重要政策。在未经授权的情况下，幸运王国不会公开或向第三方透露推广员在申请时提交的个人资料。但如根据法律规定或政府有权部门的有效命令，或在以下三种情况下，幸运王国可不经授权而向相关部门或第三方公开或透露推广员的个人信息：</br> 
a.在紧急情况下维护推广员个人、第三人或社会大众的财产或人身安全；</br> 
b.保持、维护幸运王国的知识产权或其它合法权益；</br> 
c.根据幸运王国游戏服务的相关规则、制度、条款，应当公开或披露的。</br>
四、推广收益</br>
推广员按照幸运王国相关规定申领推广收益。具体兑换规则以公司的通知为准。幸运王国将在后台确认推广业绩并在业绩确认后十个工作日内将推广收益发放至推广员账户。</br>
五、声明</br> 
幸运王国与推广员在此声明：双方不会因根据本协议产生的推广合作，构成任何形式的劳动合同关系或劳务关系。推广员不隶属于幸运王国，不受幸运王国内部规章制度的约束。幸运王国除向推广员支付本协议约定的推广收益外，不承担推广员的任何其他费用，包括但不限于因推广员因推广活动所产生的成本、社会保险、福利和医疗保险费用等。 幸运王国与推广员共同在此声明：本协议不包含任何可能理解为双方之间设立一种代理关系的内容。推广员无权代表幸运王国对外缔结合同。推广员不得以幸运王国的名义开展任何与本协议约定推广活动无关的活动，或者从事违法犯罪活动，否则一切后果由推广员自行承担，幸运王国并保留追究其法律责任的权利。</br>
六、违约责任</br> 
如推广员有违反本协议第二条第4、5、6、7、8款之规定的行为，幸运王国有权根据推广员的违约事实和严重程度，对其采取扣发推广收益、停止发放推广收益、暂停推广合作资格、停止推广合作资格等措施，并有权向推广员追讨其通过不当行为所获得的利益。 推广员对此充分理解并认可。</br>
七、不可抗力</br>
1.一方因不可抗力不能履行本协议的，根据不可抗力的影响，可以部分或者全部免除违约责任。但一方迟延履行后发生不可抗力的，不能免除责任。</br>
2.一方因不可抗力不能履行本协议的，应当及时通知对方，以减轻可能给对方造成的损失，并在合理期限内提供证明。未及时通知的，对因迟延通知而造成的扩大损失依然承担赔偿责任。</br>
3.一方因不可抗力不能履行合同，但尚未造成对本协议根本违约的，另一方应该在履约时间上给予对方适当的宽限；如果因不可抗力导致不能实现本协议目的的，双方均有权解除本协议。</br>
八、协议的生效和终止 </br>
1.协议的生效：本协议自您登录推广系统并点击“同意《协议》”时生效。</br> 
2.下列情形之一出现时，本协议终止：</br> 
a.本协议约定的合作期限届满； </br>
b.本游戏终止运营； </br>
c.在本协议有效期内，推广员被依法追究刑事责任的，幸运王国有权单方面终止本协议； </br>
d.其他按照法律规定以及本协议约定的终止情况</br>
八、其他约定 </br>
本协议未尽事宜，可由双方另行签订补充协议予以明确。补充协议的内容与本协议的内容有冲突的，优先适用补充协议的规定。</br> 推广员与幸运王国在合作中产生的争议，应当友好协商解决；协商不成的，任何一方均有权向被告所在地有管辖权的法院提起诉讼。</br>
广州谊邦成长软件科技有限公司</br>

《幸运王国》合法合规声明</br>
前言</br>
欢迎您使用广州谊邦成长软件科技有限公司开发的幸运王国棋牌游戏，以下简称广州谊邦！</br> 广州谊邦将遵循国家对网络游戏的相关规定，提倡公平、公正的游戏氛围，竭力为所有用户打造一个绿色健康的棋牌游戏环境，为用户提供更优质的服务。</br>
一、棋牌游戏相关政策</br>
1.根据文化部和公安部等相关规定，大川公司有权拒绝为用户提供积分交易、兑换或以“虚拟货币”等方式变相兑换现金、财物的服务和用户间赠与、转让等游戏积分转账服务，并且广州谊邦有权限制用户在使用幸运王国服务时每局、每日游戏币、游戏积分或者其他游戏道具输赢数量以及采取其他法律法规要求采取的措施，具体内容将由广州谊邦单独制定并在各棋牌游戏界面中以合适的方式向用户提示</br>
2.广州谊邦对于用户在幸运王国中获得的虚拟货币、游戏积分及其他游戏内虚拟物品等均不提供任何形式的官方回购、官方直接或变相兑换现金、用户间相互赠送、转让等服务及相关功能。</br>
二、禁止赌博等违法违规行为</br>
幸运王国提倡绿色健康游戏，坚决打击以任何形式利用幸运王国宣扬、实施赌博或其他违法违规的行为，包括但不限于：</br>
1.在游戏内或其他线上、线下渠道宣扬赌博或直接/变相收购、倒卖虚拟货币、游戏积分、游戏币或其他游戏道具等；</br>
2.利用幸运王国进行赌博、开设赌局、坐庄涉赌“抽水”等赌博活动；</br>
3.通过包括但不限于在游戏对局中放炮、做牌、逃跑等方式故意导致游戏币等输给其他用户、不合理拖延比赛时间而影响游戏公平的行为；</br> 
4.合伙杀猪、暗示或其他通牌行为； </br>
5.刷屏、挂机、放水等消极行为；</br> 
6.试图用第三方软件扰乱游戏环境，影响游戏数据的行为；</br>
7.一人登录多台设备，进入同一房间与其他用户进行游戏；</br>
8.其他违反《幸运王国玩家协议》或违法违规的行为；</br>
用户有以上任一行为的，广州谊邦将予以严厉打击和处罚，包括但不限于采取如下一项或几项处罚措施：警告、禁言、倒扣数值、暂时冻结玩法、永久冻结玩法、冻结或回收游戏虚拟物品、暂时禁止登陆、永久禁止登陆、强制离线、封停账号、删除档案及其他技术措施，以防止用户从事此类行为；公司对此类行为不承担任何责任，并保有提交用户不正当行为证据给相应国家管理部门，并配合进行处理的权力。</br>
欢迎各位用户积极参与进来，一起努力，共同打造一个公平、健康的游戏环境！";
        return $content;

    }


}